In [ ]:
CONCAT FUNCTION

In [6]:
#creating a data frame manually
import pandas as pd
india_weather = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'temprature':[3,70,100],
    'windspeed':[12,4,6]              
})

In [7]:
#printing the created data frame
india_weather

        city  temprature  windspeed
0     mumbai           3         12
1  bangalore          70          4
2    chennai         100          6

In [8]:
#creating a data frame manually
us_weather = pd.DataFrame ({
    'city':['vegas','cal','orlondo'],
    'temprature':[3,70,100],
    'windspeed':[12,4,6]              
})
us_weather

      city  temprature  windspeed
0    vegas           3         12
1      cal          70          4
2  orlondo         100          6

In [11]:
#concatinating the dataframes togather
df = pd.concat([india_weather,us_weather])
df

        city  temprature  windspeed
0     mumbai           3         12
1  bangalore          70          4
2    chennai         100          6
0      vegas           3         12
1        cal          70          4
2    orlondo         100          6

In [12]:
#to make the index continues
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temprature  windspeed
0     mumbai           3         12
1  bangalore          70          4
2    chennai         100          6
3      vegas           3         12
4        cal          70          4
5    orlondo         100          6

In [13]:
#to concatinate horizontally
df = pd.concat([india_weather,us_weather],axis=1)
df

        city  temprature  windspeed     city  temprature  windspeed
0     mumbai           3         12    vegas           3         12
1  bangalore          70          4      cal          70          4
2    chennai         100          6  orlondo         100          6

In [15]:
#creating two datframes and combining them horizontally
india_weather = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'temprature':[3,70,100],
    'windspeed':[12,4,6]              
},index=[0,1,2])
us_weather = pd.DataFrame ({
    'city':['vegas','cal','orlondo'],
    'temprature':[3,70,100],
    'windspeed':[12,4,6]              
},index=[1,0,2])
df = pd.concat([india_weather,us_weather],axis=1)
df

        city  temprature  windspeed     city  temprature  windspeed
0     mumbai           3         12      cal          70          4
1  bangalore          70          4    vegas           3         12
2    chennai         100          6  orlondo         100          6

In [18]:
#creating a new column using series function
s = pd.Series(['rain','sun','snow'],name='event')
s

0    rain
1     sun
2    snow
Name: event, dtype: object

In [20]:
#concatinating newly created column to the dataframe
pd.concat([df,s],axis=1)

        city  temprature  windspeed     city  temprature  windspeed event
0     mumbai           3         12      cal          70          4  rain
1  bangalore          70          4    vegas           3         12   sun
2    chennai         100          6  orlondo         100          6  snow

MERGE FUNCTION 
it is similar to JOIN concept in SQL

In [22]:
#creating two data frames manually
weather = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'temprature':[3,70,100],             
})
windspeed = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'windspeed':[12,4,6]
})
print(weather)
print(windspeed)

        city  temprature
0     mumbai           3
1  bangalore          70
2    chennai         100
        city  windspeed
0     mumbai         12
1  bangalore          4
2    chennai          6

In [23]:
#merging two data frames
pd.merge(weather,windspeed)

        city  temprature  windspeed
0     mumbai           3         12
1  bangalore          70          4
2    chennai         100          6

In [25]:
#creating two other data frame
weather = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai','hosur'],
    'temprature':[3,70,100,23],             
})
windspeed = pd.DataFrame ({
    'city':['mumbai','chennai'],
    'windspeed':[12,4]
})
print(weather)
print(windspeed)

        city  temprature
0     mumbai           3
1  bangalore          70
2    chennai         100
3      hosur          23
      city  windspeed
0   mumbai         12
1  chennai          4

In [26]:
#merging the two dataframes (perfomes inner join by default)
pd.merge(weather,windspeed)

      city  temprature  windspeed
0   mumbai           3         12
1  chennai         100          4

In [27]:
#it merges based on city
pd.merge(weather,windspeed,on='city')

      city  temprature  windspeed
0   mumbai           3         12
1  chennai         100          4

In [28]:
#performing inner join(intersection)
pd.merge(weather,windspeed,on='city',how='inner')

      city  temprature  windspeed
0   mumbai           3         12
1  chennai         100          4

In [29]:
#performing outer join(union)
pd.merge(weather,windspeed,on='city',how='outer')

        city  temprature  windspeed
0     mumbai           3       12.0
1  bangalore          70        NaN
2    chennai         100        4.0
3      hosur          23        NaN

In [30]:
#performing left join
pd.merge(weather,windspeed,on='city',how='left')

        city  temprature  windspeed
0     mumbai           3       12.0
1  bangalore          70        NaN
2    chennai         100        4.0
3      hosur          23        NaN

In [31]:
#performing right join
pd.merge(weather,windspeed,on='city',how='right')

      city  temprature  windspeed
0   mumbai           3         12
1  chennai         100          4

In [33]:
#to find out which dataframe the rows came we use indicator parameter
pd.merge(weather,windspeed,on='city',how='outer',indicator=True)

        city  temprature  windspeed     _merge
0     mumbai           3       12.0       both
1  bangalore          70        NaN  left_only
2    chennai         100        4.0       both
3      hosur          23        NaN  left_only

In [36]:
#creating two data frames
weather = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'temprature':[3,70,100],             
})
weather_1 = pd.DataFrame ({
    'city':['mumbai','bangalore','chennai'],
    'temprature':[11,7,10],             
})

In [38]:
# by merging the ide automaticallu gives suffixes to temprature column
pd.merge(weather,weather_1,on='city')

        city  temprature_x  temprature_y
0     mumbai             3            11
1  bangalore            70             7
2    chennai           100            10

In [40]:
#to change the suffix use suffixes parameter
pd.merge(weather,weather_1,on='city',suffixes=(('_left','_right'))

        city  temprature_left  temprature_right
0     mumbai                3                11
1  bangalore               70                 7
2    chennai              100                10